## terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.oauth_client.tfe_oauth_client.this will be created
  + resource "tfe_oauth_client" "this" {
      + api_url          = "https://api.github.com"
      + http_url         = "https://github.com"
      + id               = (known after apply)
      + name             = "Terraform Cloud (sophos-xdr)"
      + oauth_token      = (sensitive value)
      + oauth_token_id   = (known after apply)
      + organization     = (known after apply)
      + service_provider = "github"
    }

  # module.organization.tfe_organization.this[0] will be created
  + resource "tfe_organization" "this" {
      + collaborator_auth_policy                                = "password"
      + cost_estimation_enabled                                 = true
      + email                                                   = "ralph.brynard@sophos.com"
      + id                                                      = (known after apply)
      + name                                                    = "sophos-xdr"
      + send_passing_statuses_for_untriggered_speculative_plans = false
      + session_remember_minutes                                = 20160
      + session_timeout_minutes                                 = 20160
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + oauth_client_id = (known after apply)
  + organization_id = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```